import { translate } from '../translate';

export const code = translate(`
import {  BackTop, Button } from 'uix-react';\n
export const App:React.RC=()=>{
  return (
    <div className="Eg" style={{ height: '600px' }}>
      <BackTop action={<Button className="action">go Top</Button>}>
        <p> 我是最顶端.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
      </BackTop>
    </div>
  );
}
`);
