import React from 'react';
import { BackTop, Button } from '../../lib';

export const Demo: React.FC = () => {
  return (
    <div className="Eg" style={{ height: '600px' }}>
      <BackTop action={<Button className="action">go Top</Button>}>
        <p> 我是最顶端.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
        <p> 风吹马尾千条线，雨打羊毛一片毡.....</p>
      </BackTop>
    </div>
  );
};
